{
    "translate": "The user is requesting a translation of a word, phrase, or sentence from one language to another. They might want to understand how something is said in a specific language or learn a new linguistic expression.",
    "transfer": "This label indicates a user request to move money between two bank accounts, which may include specifying the amount, the source account, and the destination account.",
    "timer": "The user is asking to create a new timer for a specific duration. This might be used for reminders, tracking time, or timing an activity.",
    "definition": "The user is looking for a clear and precise definition of a specific word. This request helps them understand the meaning, usage, or context of the word in question.",
    "meaning_of_life": "This label represents a philosophical inquiry about the purpose or meaning of life. The user seeks an abstract or thought-provoking response to this timeless question.",
    "insurance_change": "The user is asking for guidance or steps on how to change their insurance provider, update their policy, or make adjustments to their current insurance plan.",
    "find_phone": "This is a request for assistance in locating a misplaced or lost phone. The user may want directions, notifications, or other means to find their device.",
    "travel_alert": "The user is inquiring about travel safety to a specific location, asking for information on risks, advisories, or precautions they should take.",
    "pto_request": "The user wants to request paid time off (PTO) for specific dates. This might involve submitting a formal request or checking the availability of PTO days.",
    "improve_credit_score": "A detailed question about actionable steps or strategies to improve their credit score, such as paying down debt, disputing errors, or managing credit utilization.",
    "fun_fact": "The user is asking for an interesting or surprising piece of information about a particular subject, possibly to learn something new or engage in a fun conversation.",
    "change_language": "The user wants to change the system's operating language to one they prefer or are more comfortable with.",
    "payday": "This is a query about the next payday, possibly related to their payroll schedule or upcoming payments.",
    "replacement_card_duration": "A specific question about how long it will take to receive a replacement credit or debit card after it has been requested.",
    "time": "The user wants to know the current time in a specific location, often in a different time zone or country.",
    "application_status": "This label covers user inquiries about the current status of an application, such as a credit card, loan, or other financial service.",
    "flight_status": "The user is asking about the status of their flight, including the boarding time, delays, or other updates.",
    "flip_coin": "A request to simulate flipping a coin, often to make a decision or resolve a disagreement.",
    "change_user_name": "The user wants to update the name by which the assistant or system addresses them, either to a nickname or a different identifier.",
    "where_are_you_from": "The user is curious about the origins of the assistant, asking where it or its creators come from.",
    "shopping_list_update": "This label indicates a user request to verify whether an item is on their shopping list and, if not, to add it.",
    "what_can_i_ask_you": "A general query about the capabilities of the assistant, seeking a list of categories or examples of questions they can ask.",
    "maybe": "A response indicating that the system lacks sufficient information or certainty to provide a definitive answer.",
    "oil_change_how": "The user is asking for a detailed guide or procedure on how to perform an oil change on a car, possibly including tools and steps required.",
    "restaurant_reservation": "The user is requesting to book a table at a specific restaurant, specifying details such as the number of people, the time, and the name under which to reserve.",
    "balance": "This represents a query about the user’s bank account balance, often asking for specific details like whether they have more than a certain amount.",
    "confirm_reservation": "The user wants to verify the details of an existing reservation, ensuring that everything is correct and confirmed.",
    "freeze_account": "A request to temporarily stop payments or transactions on a bank account due to security or financial reasons.",
    "rollover_401k": "The user is asking for information or assistance in rolling over a 401k retirement account to another account or provider.",
    "who_made_you": "A question about the creator or developer of the assistant, reflecting curiosity about its origin or purpose.",
    "distance": "The user is inquiring about the travel time or distance to a specific location, often using real-time traffic or route data.",
    "user_name": "The user is asking if the system knows their name, possibly checking if the assistant recognizes or remembers their identity.",
    "timezone": "A request for the current timezone of a specified location, helping the user align their plans or understand time differences.",
    "next_song": "The user is asking to skip the current track and play the next song in the playlist or queue.",
    "transactions": "A request to display a list of recent transactions, specifically focused on video game purchases.",
    "restaurant_suggestion": "The user is seeking recommendations for places to eat, possibly for a specific meal or occasion.",
    "rewards_balance": "A query about the current balance of rewards or points associated with a specific credit card, such as Visa.",
    "pay_bill": "The user is asking for assistance with paying a bill, which might include utility, phone, or other recurring payments.",
    "spending_history": "A request to review recent financial activity or spending, providing insight into where money has been spent recently.",
    "pto_request_status": "The user wants to know whether their paid time off (PTO) request has been approved or denied.",
    "credit_score": "A query to retrieve the user’s credit score from a specific credit reporting agency, like Experian.",
    "new_card": "The user is seeking advice on the best credit card options available, particularly for specific demographics like college students.",
    "lost_luggage": "The user is asking for guidance on whom to contact regarding lost luggage, likely related to airline travel.",
    "repeat": "A request to replay or repeat a previously performed action, such as playing a song or repeating spoken information.",
    "mpg": "The user wants to know the fuel efficiency (miles per gallon) of their vehicle, particularly for city driving.",
    "oil_change_when": "A question about the appropriate timing for an oil change, either based on mileage or time.",
    "yes": "An affirmative response indicating agreement or confirmation.",
    "travel_suggestion": "The user is seeking recommendations for destinations or activities to do in a specific location, such as Arizona.",
    "insurance": "A question about the coverage details of the user’s insurance policy, such as what is included or excluded.",
    "todo_list_update": "The user is requesting changes to their to-do list, such as adding and canceling tasks or items.",
    "reminder": "A request to read out or provide a list of reminders the user has set.",
    "change_speed": "The user wants the assistant to adjust its speaking speed, typically to speak more slowly.",
    "tire_pressure": "The user is asking to check the air pressure in their tires and confirm whether it is at an acceptable level.",
    "no": "A response indicating refusal, disinterest, or declining an offer.",
    "apr": "The user is asking about the Annual Percentage Rate (APR) on a credit card and whether it aligns with their credit score.",
    "nutrition_info": "A request to provide nutritional information or health-related details about a specific dish, like shepherd’s pie.",
    "calendar": "The user wants information about events or appointments scheduled on a specific day, such as Tuesday.",
    "uber": "A request to schedule a ride with Uber, including details like the number of passengers, time, and destination.",
    "calculator": "The user is asking for help solving a math problem or equation.",
    "date": "A request for the current date, often to check the day or align plans.",
    "carry_on": "A query about the rules for carrying multiple items, such as bags, on a flight.",
    "pto_used": "The user is asking how many paid time off (PTO) days they have used so far.",
    "schedule_maintenance": "A request to book a maintenance appointment, such as an oil change, at the earliest available time.",
    "travel_notification": "The user wants to notify their bank about upcoming travel plans to avoid transaction issues during the trip.",
    "sync_device": "A request to synchronize data or settings between devices, such as syncing a phone.",
    "thank_you": "A message of gratitude expressing thanks for help or assistance provided.",
    "roll_dice": "The user is asking to simulate rolling a dice, often for decision-making or gameplay.",
    "food_last": "A question about the safety of consuming food, such as milk, based on how long it has been stored.",
    "cook_time": "A request for the cooking time required to prepare a specific dish, like pot-au-feu.",
    "reminder_update": "A request to set, update, or modify a reminder, such as reminding the user to call their mom.",
    "report_lost_card": "The user wants to report their card as lost or stolen and seeks guidance or action to address the issue.",
    "ingredient_substitution": "The user is asking if an alternative ingredient (e.g., chips instead of fries) can be used in a recipe or meal.",
    "make_call": "A request to place a phone call to a specific person, such as Alex.",
    "alarm": "The user wants to set one or more alarms for specific times, ensuring reminders or wake-ups.",
    "todo_list": "A request to read or repeat the user's to-do list, listing tasks or items they’ve recorded.",
    "change_accent": "The user wants the assistant to change its accent, such as switching to a male British voice.",
    "w2": "A question about obtaining a W-2 form, typically for tax purposes, including the process or source to acquire it.",
    "bill_due": "The user is asking for the due date of a specific bill, such as their energy bill.",
    "calories": "A query about the calorie content of a specific food item, such as Lay's chips.",
    "damaged_card": "The user wants to report a damaged card, possibly due to an accident or exposure to substances like bleach.",
    "restaurant_reviews": "The user is inquiring about the quality or ratings of a specific restaurant, such as McDonald’s.",
    "routing": "A request to provide the routing number of a specific bank, such as Chase.",
    "do_you_have_pets": "The user is asking about the assistant’s or user’s home environment, specifically regarding pets.",
    "schedule_meeting": "A request to schedule a meeting, potentially involving date, time, and participant details.",
    "gas_type": "The user wants to know the recommended or best type of gasoline for their car.",
    "plug_type": "A query about the type of power sockets or plugs used in a specific region, such as the US.",
    "tire_change": "The user is asking for advice or timing on when they should change their car tires.",
    "exchange_rate": "A request to provide the current exchange rate between two currencies, such as USD to EUR.",
    "next_holiday": "The user is asking for the date of the next holiday, possibly to plan activities.",
    "change_volume": "A request to adjust the assistant’s speaking volume, typically to make it quieter.",
    "who_do_you_work_for": "The user is inquiring about the assistant’s creator or employer.",
    "credit_limit": "A query about the spending limit on a specific credit card, such as a Victoria’s Secret card.",
    "how_busy": "The user wants to know the current or expected wait time at a specific location, such as a restaurant.",
    "accept_reservations": "A question about whether a particular restaurant accepts reservations, such as Spago in Beverly Hills.",
    "order_status": "The user is asking whether their order has been delivered or its current status.",
    "pin_change": "A request for help with resetting or changing a PIN for a bank account.",
    "goodbye": "A casual farewell or goodbye message, indicating the end of the interaction.",
    "account_blocked": "The user is reporting that their account appears to be blocked and seeks assistance in resolving the issue.",
    "what_song": "A query asking the assistant to identify the currently playing song.",
    "international_fees": "The user is inquiring whether their credit card charges fees for international transactions.",
    "last_maintenance": "A request to know the date of the last maintenance activity, such as getting new tires.",
    "meeting_schedule": "The user is asking for information about meetings scheduled for the current day.",
    "ingredients_list": "A request for the full list of ingredients needed to prepare a specific dish, like lamb stew.",
    "report_fraud": "The user wants to report fraudulent activity on their credit card and seeks help contacting the bank.",
    "measurement_conversion": "A query to convert measurements, such as pints to quarts or other units.",
    "smart_home": "The user is requesting information about or control over a smart home device, such as the temperature of the AC.",
    "book_hotel": "A request to reserve a hotel room for specific dates and possibly a location, such as near a zoo in Afghanistan.",
    "current_location": "The user is asking for information about their current geographical location.",
    "weather": "A query about the current weather conditions or forecast for a specific location.",
    "taxes": "The user is asking for an estimate of how much money they spend annually on taxes.",
    "min_payment": "The user is asking for the minimum payment required for a specific bill, such as their cable bill.",
    "whisper_mode": "A request to enable whisper mode, where the assistant speaks more quietly.",
    "cancel": "A command to stop the current interaction or request the assistant to stop speaking.",
    "international_visa": "A query about visa requirements for traveling to a specific country.",
    "vaccines": "The user is asking whether vaccinations are necessary for travel to a particular destination, such as India.",
    "pto_balance": "A request to know the number of vacation or paid time off (PTO) days the user has saved up.",
    "directions": "The user is asking for directions to a specific location, such as the nearest subway entrance.",
    "spelling": "A request to spell out a specific word, such as \"dessert.\"",
    "greeting": "A casual greeting or expression of interest in how the assistant is doing.",
    "reset_settings": "The user wants to restore the system or assistant to its factory default settings.",
    "what_is_your_name": "A query asking the assistant what name it goes by or how the user can address it.",
    "direct_deposit": "A request for guidance on setting up direct deposit, possibly for a specific bank account.",
    "interest_rate": "The user is asking about the interest rate they can expect with a specific bank or account.",
    "credit_limit_change": "A request for instructions on how to change or increase the credit limit on their account.",
    "what_are_your_hobbies": "A casual inquiry asking if the assistant has hobbies or interests.",
    "book_flight": "A request to book a round-trip flight, specifying dates and locations, such as Denver to New York.",
    "shopping_list": "A request to read out the items currently on the user’s shopping list.",
    "text": "The user wants to send a text message to a specific contact, such as Joe.",
    "bill_balance": "A request for the total amount due on a specific bill.",
    "share_location": "A command to share the user’s current location with a specific person, such as Stan.",
    "redeem_rewards": "A request to redeem credit card rewards for cash, travel, or other benefits.",
    "play_music": "The user is asking the assistant to play a specific song, such as \"Sympathy for the Devil.\"",
    "calendar_update": "A request to update or remove an event from the user’s calendar, such as a field trip.",
    "are_you_a_bot": "The user is asking whether the assistant is a bot or a real person.",
    "gas": "A query about the current level of gas in the user’s car tank.",
    "expiration_date": "The user is asking for the expiration date of a specific card, such as a Visa card.",
    "update_playlist": "A request to add a song to a specific playlist, such as \"travel.\"",
    "cancel_reservation": "The user wants to cancel a reservation at a particular venue, such as Nenuco’s restaurant.",
    "tell_joke": "A request for the assistant to share a joke or something funny.",
    "change_ai_name": "The user wants to change the name they use to address the assistant, such as calling it \"Dave.\"",
    "how_old_are_you": "A casual query about the assistant’s age.",
    "car_rental": "A request to arrange a car rental for a specific time, such as the current week.",
    "jump_start": "The user is asking for instructions on jump-starting a car with a dead battery.",
    "meal_suggestion": "A request for meal suggestions, such as a Chinese dish recommendation.",
    "recipe": "The user is asking for a recipe to prepare a specific dish, such as cookies.",
    "income": "A query about the user’s income, typically before taxes.",
    "order": "A request to place an order for a specific item, such as more bread.",
    "traffic": "The user is asking about the current traffic conditions between two locations, such as home and work.",
    "order_checks": "A request to order more checks, as the user has run out.",
    "card_declined": "The user is asking why their credit card was declined or seeking assistance to resolve the issue."
}